blog/content/post/semantic-postgresql.org
+++
title = "Busca Semântica com Ollama e PostgreSQL"
description = "Implementando busca semântica com PostgreSQL e Ollama"
date = 2025-03-25T12:00:00-00:00
tags = ["RAG", "PostgreSQL", "pgvector", "pgai", "Ollama", "Semantic Search"]
draft = true
weight = 2
author = "Vitor Lobo Ramos"
+++

Olá, pessoal! 👋

No [[/post/rag/][artigo anterior]], exploramos como construir um sistema RAG (Retrieval-Augmented Generation) usando [[https://clojure.org/][Clojure]] e [[https://ollama.com/][Ollama]] com uma implementação simples de [[/post/tf-idf/][TF-IDF]]. Embora essa abordagem seja excelente para aprender os fundamentos, quando pensamos em soluções de produção, precisamos de algo mais robusto e escalável.

Neste artigo, vamos descobrir como construir um sistema de busca semântica poderoso usando [[https://ollama.com/][Ollama]], [[https://www.postgresql.org/][PostgreSQL]] e suas extensões para manipulação de vetores. Esta solução é perfeitamente adequada para aplicações de produção e pode servir como base para sistemas RAG, agentes de IA, assistentes em geral. Diferentemente do artigo anterior, vamos usar o [[https://ollama.com/][Ollama]] via Docker assim como o [[https://www.postgresql.org/][PostgreSQL]] e as extensões [[https://github.com/pgvector/pgvector][pgvector]] e [[https://github.com/timescale/pgai][pgai]].

A combinação do [[https://www.postgresql.org/][PostgreSQL]] com extensões como [[https://github.com/pgvector/pgvector][pgvector]] e [[https://github.com/timescale/pgai][pgai]], junto com o [[https://ollama.com/][Ollama]] (que permite executar modelos de linguagem localmente), cria uma solução completa e de alto desempenho para [[https://en.wikipedia.org/wiki/Semantic_search][processamento semântico de dados]].

** Entendendo a Arquitetura

A busca semântica vai além da simples correspondência de palavras-chave, capturando o significado e o contexto da sua consulta. Em vez de depender apenas de correspondências exatas, ela utiliza [[https://en.wikipedia.org/wiki/Embedding_(machine_learning][embeddings vetoriais]]) para representar o conteúdo semântico do texto (ou qualquer dado não estruturado). Essa abordagem permite que seu sistema recupere resultados contextualmente relevantes, mesmo quando as palavras-chave exatas não estão presentes.

Por exemplo, se você pesquisar por "melhores lugares para comer", um [[https://en.wikipedia.org/wiki/Semantic_search][sistema de busca semântica]] pode recuperar documentos sobre "restaurantes bem avaliados nas proximidades" ou "experiências gastronômicas altamente recomendadas", efetivamente capturando sua intenção em vez da formulação exata. A arquitetura para busca semântica com PostgreSQL envolve quatro componentes principais:

#+BEGIN_SRC mermaid
flowchart LR
    A[Ollama] --> B[pgai]
    B --> C[pgvector]
    C --> D[PostgreSQL]
    
    style A fill:#f9f,stroke:#333,stroke-width:2px
    style D fill:#9ff,stroke:#333,stroke-width:2px
#+END_SRC

- [[https://ollama.com/][/Ollama/]]: Ferramenta open-source que permite executar e gerenciar modelos de linguagem de grande escala (LLMs) e modelos de visão (VLMs) localmente no seu computador ou em um servidor cloud, proporcionando maior privacidade e controle sobre os dados.
- [[https://github.com/timescale/pgai][/pgai/]]: Extensão do PostgreSQL que simplifica o armazenamento e recuperação de dados para RAG e outras aplicações de IA, automatizando a criação e gestão de embeddings, facilitando a busca semântica e permitindo a execução de funções de LLM diretamente dentro de consultas SQL.
- [[https://github.com/pgvector/pgvector][/pgvector/]]: Extensão do PostgreSQL que adiciona suporte para armazenar, indexar e consultar embeddings vetoriais de alta dimensionalidade.
- [[https://www.postgresql.org/][/PostgreSQL/]]: O sistema de banco de dados relacional que serve como fundação robusta e escalável para todo o sistema.

-----

