blog/content/post/semantic-postgresql.org
** Pré-requisitos

Antes de começar, precisamos garantir que você tenha:

1. /Docker e Docker Compose/: Para configurar o ambiente facilmente
2. /PostgreSQL com pgvector e pgai/: Para armazenar e consultar embeddings

#+BEGIN_QUOTE
/NOTA/: No artigo anterior sobre [[/post/rag/][RAG em Clojure]], usamos o [[https://ollama.com/][Ollama]] com [[https://ollama.com/models/deepseek-r1][DeepSeek R1]] baixando o projeto ollama diretamente na máquina. Nesta abordagem, vamos usar o Ollama via Docker. Portanto, recomendo que você feche o Ollama para usar-mos ele inteiramente via Docker aqui nesta abordagem (é necessário fechar para não conflitar com o endpoint do Ollama que vamos usar no Docker Compose).
#+END_QUOTE

Vamos configurar tudo isso rapidamente usando Docker Compose:

#+BEGIN_SRC bash
name: pgai
services:
  db:
    image: timescale/timescaledb-ha:pg17
    environment:
      POSTGRES_PASSWORD: postgres
      # Definir variáveis de ambiente para o host do Ollama
      OLLAMA_HOST: http://ollama:11434
    ports:
      - "5432:5432"
    volumes:
      - data:/home/postgres/pgdata/data
    # Não use a extensão ai até garantir que está instalada corretamente
    command: "-c search_path=public"
    depends_on:
      - ollama
    # Adicionar links explícitos para o serviço Ollama
    links:
      - ollama

  vectorizer-worker:
    image: timescale/pgai-vectorizer-worker:latest
    environment:
      PGAI_VECTORIZER_WORKER_DB_URL: postgres://postgres:postgres@db:5432/postgres
      OLLAMA_HOST: http://ollama:11434
    command: [ "--poll-interval", "5s", "--log-level", "DEBUG" ]
    depends_on:
      - db
      - ollama
    links:
      - ollama

  ollama:
    image: ollama/ollama
    ports:
      - "11434:11434"
    volumes:
      - ollama_data:/root/.ollama
    # Comando direto para iniciar o Ollama
    command: serve

volumes:
  data:
  ollama_data: 
#+END_SRC

O arquivo ~docker-compose.yml~ acima configura uma infraestrutura para busca semântica com três serviços interconectados. O serviço ~db~ utiliza o [[https://www.timescale.com/][TimescaleDB]] (que nada mais é que uma versão do [[https://www.postgresql.org/][PostgreSQL]] especializada para otimização de desempenho para dados de séries temporais) com a versão 17, configurando credenciais, mapeamento de portas e um volume persistente para armazenar os dados. Este serviço é configurado para se comunicar com o Ollama através de variáveis de ambiente e links explícitos, garantindo que a comunicação entre os contêineres funcione corretamente.

#+BEGIN_SRC mermaid
flowchart TD
    subgraph db ["TimescaleDB (pg17)"]
        db_info["Ports: 5432:5432<br>Volumes: data:/home/postgres/pgdata/data<br>Environment:<br>POSTGRES_PASSWORD=postgres<br>OLLAMA_HOST=http://ollama:11434"]
    end

    subgraph vectorizer_worker ["pgai-vectorizer-worker"]
        vw_info["Environment:<br>PGAI_VECTORIZER_WORKER_DB_URL=postgres://postgres:postgres@db:5432/postgres<br>OLLAMA_HOST=http://ollama:11434<br>Command: --poll-interval 5s --log-level DEBUG"]
    end

    subgraph ollama ["Ollama"]
        o_info["Ports: 11434:11434<br>Volumes: ollama_data:/root/.ollama<br>Command: serve"]
    end

    data["Data Volume"]
    ollama_data["Ollama Data Volume"]

    db --- data
    ollama --- ollama_data
    vectorizer_worker --- db
    vectorizer_worker --- ollama
    db --- ollama

    style db fill:#f9f,stroke:#333,stroke-width:2px
    style vectorizer_worker fill:#ccf,stroke:#333,stroke-width:2px
    style ollama fill:#ffc,stroke:#333,stroke-width:2px
    style data fill:#eee,stroke:#333,stroke-width:2px
    style ollama_data fill:#eee,stroke:#333,stroke-width:2px
#+END_SRC

O diagrama acima ilustra a arquitetura do sistema de busca semântica com PostgreSQL. No centro, temos três componentes principais: o TimescaleDB (uma versão especializada do PostgreSQL), o pgai-vectorizer-worker (responsável por processar e vetorizar os textos) e o Ollama (que fornece os modelos de IA). As conexões entre os serviços mostram como eles se comunicam: o vectorizer-worker se conecta tanto ao banco de dados quanto ao Ollama para realizar seu trabalho de transformação de textos em vetores. 

Os volumes persistentes (representados em cinza) garantem que tanto os dados do PostgreSQL quanto os modelos do Ollama sejam preservados entre reinicializações. Esta arquitetura modular permite escalar cada componente independentemente conforme necessário, enquanto mantém um fluxo de dados eficiente para operações de busca semântica.


O serviço ~vectorizer-worker~ é um componente especializado do [[https://github.com/timescale/pgai][pgai]] que monitora o banco de dados a cada 5 segundos, processando automaticamente textos para transformá-los em embeddings vetoriais. Ele se conecta ao banco [[https://www.postgresql.org/][PostgreSQL]] e ao serviço [[https://ollama.com/][Ollama]] para realizar a vetorização dos textos, funcionando como uma ponte entre o armazenamento de dados e o modelo de IA, com logs detalhados para facilitar a depuração durante o desenvolvimento.

Por fim, o serviço ~ollama~ fornece a infraestrutura para executar modelos de IA localmente, expondo uma API REST na porta 11434 e armazenando os modelos baixados em um volume persistente. Este design de três camadas (banco de dados, processador de vetores e motor de IA) cria um sistema completo para busca semântica que pode ser iniciado com um simples ~docker compose up -d~, seguido pelo download do modelo de [[https://en.wikipedia.org/wiki/Embedding_(machine_learning][embeddings]]) que transformará os textos em vetores.

#+BEGIN_SRC bash
docker compose exec ollama ollama pull nomic-embed-text
#+END_SRC

Este setup configura um banco de dados PostgreSQL com as extensões [[https://github.com/timescale/pgai][pgai]], [[https://github.com/pgvector/pgvector][pgvector]] e [[https://github.com/timescale/pgvectorscale][pgvectorscale]]. Também configura o Ollama, que você pode usar para implantar LLMs e modelos de embedding.

-----

