semantic-postgresql/index.html
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
Pré-requisitos
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<p>
Antes de começar, precisamos garantir que você tenha:</p>
<ol>
<li><em>Docker e Docker Compose</em>: Para configurar o ambiente facilmente</li>
<li><em>PostgreSQL com pgvector e pgai</em>: Para armazenar e consultar embeddings</li>
</ol>
<blockquote>
<p><em>NOTA</em>: No artigo anterior sobre <a href="/post/rag/">RAG em Clojure</a>, usamos o <a href="https://ollama.com/">Ollama</a> com <a href="https://ollama.com/models/deepseek-r1">DeepSeek R1</a> baixando o projeto ollama diretamente na máquina. Nesta abordagem, vamos usar o Ollama via Docker. Portanto, recomendo que você feche o Ollama para usar-mos ele inteiramente via Docker aqui nesta abordagem (é necessário fechar para não conflitar com o endpoint do Ollama que vamos usar no Docker Compose).</p>
</blockquote>
<p>
Vamos configurar tudo isso rapidamente usando Docker Compose:</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-bash" data-lang="bash"><span class="line"><span class="cl">name: pgai
</span></span><span class="line"><span class="cl">services:
</span></span><span class="line"><span class="cl">  db:
</span></span><span class="line"><span class="cl">    image: timescale/timescaledb-ha:pg17
</span></span><span class="line"><span class="cl">    environment:
</span></span><span class="line"><span class="cl">      POSTGRES_PASSWORD: postgres
</span></span><span class="line"><span class="cl">      <span class="c1"># Definir variáveis de ambiente para o host do Ollama</span>
</span></span><span class="line"><span class="cl">      OLLAMA_HOST: http://ollama:11434
</span></span><span class="line"><span class="cl">    ports:
</span></span><span class="line"><span class="cl">      - <span class="s2">&#34;5432:5432&#34;</span>
</span></span><span class="line"><span class="cl">    volumes:
</span></span><span class="line"><span class="cl">      - data:/home/postgres/pgdata/data
</span></span><span class="line"><span class="cl">    <span class="c1"># Não use a extensão ai até garantir que está instalada corretamente</span>
</span></span><span class="line"><span class="cl">    command: <span class="s2">&#34;-c search_path=public&#34;</span>
</span></span><span class="line"><span class="cl">    depends_on:
</span></span><span class="line"><span class="cl">      - ollama
</span></span><span class="line"><span class="cl">    <span class="c1"># Adicionar links explícitos para o serviço Ollama</span>
</span></span><span class="line"><span class="cl">    links:
</span></span><span class="line"><span class="cl">      - ollama
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">  vectorizer-worker:
</span></span><span class="line"><span class="cl">    image: timescale/pgai-vectorizer-worker:latest
</span></span><span class="line"><span class="cl">    environment:
</span></span><span class="line"><span class="cl">      PGAI_VECTORIZER_WORKER_DB_URL: postgres://postgres:postgres@db:5432/postgres
</span></span><span class="line"><span class="cl">      OLLAMA_HOST: http://ollama:11434
</span></span><span class="line"><span class="cl">    command: <span class="o">[</span> <span class="s2">&#34;--poll-interval&#34;</span>, <span class="s2">&#34;5s&#34;</span>, <span class="s2">&#34;--log-level&#34;</span>, <span class="s2">&#34;DEBUG&#34;</span> <span class="o">]</span>
</span></span><span class="line"><span class="cl">    depends_on:
</span></span><span class="line"><span class="cl">      - db
</span></span><span class="line"><span class="cl">      - ollama
</span></span><span class="line"><span class="cl">    links:
</span></span><span class="line"><span class="cl">      - ollama
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">  ollama:
</span></span><span class="line"><span class="cl">    image: ollama/ollama
</span></span><span class="line"><span class="cl">    ports:
</span></span><span class="line"><span class="cl">      - <span class="s2">&#34;11434:11434&#34;</span>
</span></span><span class="line"><span class="cl">    volumes:
</span></span><span class="line"><span class="cl">      - ollama_data:/root/.ollama
</span></span><span class="line"><span class="cl">    <span class="c1"># Comando direto para iniciar o Ollama</span>
</span></span><span class="line"><span class="cl">    command: serve
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">volumes:
</span></span><span class="line"><span class="cl">  data:
</span></span><span class="line"><span class="cl">  ollama_data:</span></span></code></pre></div>
</div>
<p>
O arquivo <code>docker-compose.yml</code> acima configura uma infraestrutura para busca semântica com três serviços interconectados. O serviço <code>db</code> utiliza o <a href="https://www.timescale.com/">TimescaleDB</a> (que nada mais é que uma versão do <a href="https://www.postgresql.org/">PostgreSQL</a> especializada para otimização de desempenho para dados de séries temporais) com a versão 17, configurando credenciais, mapeamento de portas e um volume persistente para armazenar os dados. Este serviço é configurado para se comunicar com o Ollama através de variáveis de ambiente e links explícitos, garantindo que a comunicação entre os contêineres funcione corretamente.</p>
<div class="src src-mermaid">
<pre tabindex="0"><code class="language-mermaid" data-lang="mermaid">flowchart TD
    subgraph db [&#34;TimescaleDB (pg17)&#34;]
        db_info[&#34;Ports: 5432:5432&lt;br&gt;Volumes: data:/home/postgres/pgdata/data&lt;br&gt;Environment:&lt;br&gt;POSTGRES_PASSWORD=postgres&lt;br&gt;OLLAMA_HOST=http://ollama:11434&#34;]
    end

    subgraph vectorizer_worker [&#34;pgai-vectorizer-worker&#34;]
        vw_info[&#34;Environment:&lt;br&gt;PGAI_VECTORIZER_WORKER_DB_URL=postgres://postgres:postgres@db:5432/postgres&lt;br&gt;OLLAMA_HOST=http://ollama:11434&lt;br&gt;Command: --poll-interval 5s --log-level DEBUG&#34;]
    end

    subgraph ollama [&#34;Ollama&#34;]
        o_info[&#34;Ports: 11434:11434&lt;br&gt;Volumes: ollama_data:/root/.ollama&lt;br&gt;Command: serve&#34;]
    end

    data[&#34;Data Volume&#34;]
    ollama_data[&#34;Ollama Data Volume&#34;]

    db --- data
    ollama --- ollama_data
    vectorizer_worker --- db
    vectorizer_worker --- ollama
    db --- ollama

    style db fill:#f9f,stroke:#333,stroke-width:2px
    style vectorizer_worker fill:#ccf,stroke:#333,stroke-width:2px
    style ollama fill:#ffc,stroke:#333,stroke-width:2px
    style data fill:#eee,stroke:#333,stroke-width:2px
    style ollama_data fill:#eee,stroke:#333,stroke-width:2px</code></pre>
</div>
<p>
O diagrama acima ilustra a arquitetura do sistema de busca semântica com PostgreSQL. No centro, temos três componentes principais: o TimescaleDB (uma versão especializada do PostgreSQL), o pgai-vectorizer-worker (responsável por processar e vetorizar os textos) e o Ollama (que fornece os modelos de IA). As conexões entre os serviços mostram como eles se comunicam: o vectorizer-worker se conecta tanto ao banco de dados quanto ao Ollama para realizar seu trabalho de transformação de textos em vetores. </p>
<p>
Os volumes persistentes (representados em cinza) garantem que tanto os dados do PostgreSQL quanto os modelos do Ollama sejam preservados entre reinicializações. Esta arquitetura modular permite escalar cada componente independentemente conforme necessário, enquanto mantém um fluxo de dados eficiente para operações de busca semântica.</p>
<p>
O serviço <code>vectorizer-worker</code> é um componente especializado do <a href="https://github.com/timescale/pgai">pgai</a> que monitora o banco de dados a cada 5 segundos, processando automaticamente textos para transformá-los em embeddings vetoriais. Ele se conecta ao banco <a href="https://www.postgresql.org/">PostgreSQL</a> e ao serviço <a href="https://ollama.com/">Ollama</a> para realizar a vetorização dos textos, funcionando como uma ponte entre o armazenamento de dados e o modelo de IA, com logs detalhados para facilitar a depuração durante o desenvolvimento.</p>
<p>
Por fim, o serviço <code>ollama</code> fornece a infraestrutura para executar modelos de IA localmente, expondo uma API REST na porta 11434 e armazenando os modelos baixados em um volume persistente. Este design de três camadas (banco de dados, processador de vetores e motor de IA) cria um sistema completo para busca semântica que pode ser iniciado com um simples <code>docker compose up -d</code>, seguido pelo download do modelo de <a href="https://en.wikipedia.org/wiki/Embedding_(machine_learning">embeddings</a>) que transformará os textos em vetores.</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-bash" data-lang="bash"><span class="line"><span class="cl">docker compose <span class="nb">exec</span> ollama ollama pull nomic-embed-text</span></span></code></pre></div>
</div>
<p>
Este setup configura um banco de dados PostgreSQL com as extensões <a href="https://github.com/timescale/pgai">pgai</a>, <a href="https://github.com/pgvector/pgvector">pgvector</a> e <a href="https://github.com/timescale/pgvectorscale">pgvectorscale</a>. Também configura o Ollama, que você pode usar para implantar LLMs e modelos de embedding.</p>
<hr>
</div>
</div>
