blog/content/post/semantic-postgresql.org
** Passos para Construir a Busca Semântica

Os passos para implementar a busca semântica no PostgreSQL são relativamente simples. Primeiro, vamos habilitar as extensões necessárias, criar uma tabela para armazenar nossos documentos, configurar o [[https://github.com/timescale/pgai/tree/main/vectorizer][vectorizer]] para gerar [[https://en.wikipedia.org/wiki/Embedding_(machine_learning][embeddings]]) automaticamente e, finalmente, realizar consultas semânticas.

*** 1. Habilitando as Extensões

Primeiro, precisamos habilitar as extensões necessárias no PostgreSQL:

#+BEGIN_SRC sql
CREATE EXTENSION IF NOT EXISTS vector CASCADE; 
CREATE EXTENSION IF NOT EXISTS ai CASCADE;
#+END_SRC

*** 2. Criando a Tabela de Documentos

Agora, vamos criar uma tabela para armazenar os documentos que queremos pesquisar:

#+BEGIN_SRC sql
CREATE TABLE IF NOT EXISTS documentos (
   id SERIAL PRIMARY KEY,
   titulo TEXT NOT NULL,
   conteudo TEXT,
   categoria TEXT,
   data_criacao TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);
#+END_SRC

Neste exemplo, criamos uma tabela chamada ~documentos~ com quatro colunas: ~id~, ~titulo~, ~conteudo~ e ~categoria~. É importante notar que a coluna ~id~ é a chave primária da tabela. Outro ponto importante é que a coluna ~data_criacao~ é uma coluna de metadados que é gerada automaticamente pelo PostgreSQL.

*** 3. Inserindo Documentos

Podemos inserir documentos manualmente ou usar a função ~ai.load_dataset~ do [[https://github.com/timescale/pgai][pgai]] para carregar dados diretamente do [[https://huggingface.co/][Hugging Face]]:

#+BEGIN_SRC sql
SELECT ai.load_dataset(
   name => 'Cohere/movies',
   table_name => 'documentos',
   if_table_exists => 'append',
   field_types => '{"title": "titulo", "overview": "conteudo", "genres": "categoria"}'::jsonb
);
#+END_SRC

Alternativamente, podemos inserir registros manualmente:

#+BEGIN_SRC sql
INSERT INTO documentos (titulo, conteudo, categoria) VALUES 
('Guia Clojure', 'Clojure é uma linguagem funcional moderna...', 'Programação'),
('Tutorial RAG', 'Sistemas RAG combinam busca e geração...', 'IA'),
('PostgreSQL Avançado', 'Técnicas de otimização para PostgreSQL...', 'Banco de Dados');
#+END_SRC

#+BEGIN_QUOTE
/NOTA/: O [[https://huggingface.co/][Hugging Face]] é uma plataforma de dados e modelos de IA.
#+END_QUOTE

Agora vamos configurar o vectorizer para gerar embeddings automaticamente.

*** 4. Configurando o Vectorizer

O [[https://github.com/timescale/pgai][pgai]] inclui uma ferramenta chamada [[https://github.com/timescale/pgai/tree/main/vectorizer][vectorizer]] que automatiza a criação e sincronização de embeddings. Esta é uma das funcionalidades mais poderosas desta solução, pois elimina a necessidade de ferramentas externas para criar [[https://en.wikipedia.org/wiki/Embedding_(machine_learning][embeddings]]). Vamos configurá-la:

#+BEGIN_SRC sql
SELECT ai.create_vectorizer(
   'public.documentos'::regclass,
   destination => 'documentos_embeddings',
   embedding => ai.embedding_ollama('nomic-embed-text', 768),
   chunking => ai.chunking_recursive_character_text_splitter('conteudo')
);
#+END_SRC

Basicamente, o comando acima faz o seguinte:

1. Cria uma tabela ~documentos_embeddings~ para armazenar os vetores
2. Configura o modelo ~nomic-embed-text~ via Ollama para gerar embeddings
3. Define uma estratégia de chunking para dividir textos longos
4. Cria automaticamente uma view ~documentos_embeddings_vectorized~ que junta os documentos com seus embeddings

O [[https://github.com/timescale/pgai/tree/main/vectorizer][vectorizer]] também cuida da sincronização automática dos embeddings quando documentos são inseridos, atualizados ou removidos - sem necessidade de código adicional! Isto simplifica enormemente a manutenção do sistema.

