semantic-postgresql/index.html
<div id="outline-container-headline-3" class="outline-3">
<h3 id="headline-3">
Passos para Construir a Busca Semântica
</h3>
<div id="outline-text-headline-3" class="outline-text-3">
<p>
Os passos para implementar a busca semântica no PostgreSQL são relativamente simples. Primeiro, vamos habilitar as extensões necessárias, criar uma tabela para armazenar nossos documentos, configurar o <a href="https://github.com/timescale/pgai/tree/main/vectorizer">vectorizer</a> para gerar <a href="https://en.wikipedia.org/wiki/Embedding_(machine_learning">embeddings</a>) automaticamente e, finalmente, realizar consultas semânticas.</p>
<div id="outline-container-headline-4" class="outline-4">
<h4 id="headline-4">
1. Habilitando as Extensões
</h4>
<div id="outline-text-headline-4" class="outline-text-4">
<p>
Primeiro, precisamos habilitar as extensões necessárias no PostgreSQL:</p>
<div class="src src-sql">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-sql" data-lang="sql"><span class="line"><span class="cl"><span class="k">CREATE</span><span class="w"> </span><span class="n">EXTENSION</span><span class="w"> </span><span class="k">IF</span><span class="w"> </span><span class="k">NOT</span><span class="w"> </span><span class="k">EXISTS</span><span class="w"> </span><span class="n">vector</span><span class="w"> </span><span class="k">CASCADE</span><span class="p">;</span><span class="w"> 
</span></span></span><span class="line"><span class="cl"><span class="k">CREATE</span><span class="w"> </span><span class="n">EXTENSION</span><span class="w"> </span><span class="k">IF</span><span class="w"> </span><span class="k">NOT</span><span class="w"> </span><span class="k">EXISTS</span><span class="w"> </span><span class="n">ai</span><span class="w"> </span><span class="k">CASCADE</span><span class="p">;</span></span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-5" class="outline-4">
<h4 id="headline-5">
2. Criando a Tabela de Documentos
</h4>
<div id="outline-text-headline-5" class="outline-text-4">
<p>
Agora, vamos criar uma tabela para armazenar os documentos que queremos pesquisar:</p>
<div class="src src-sql">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-sql" data-lang="sql"><span class="line"><span class="cl"><span class="k">CREATE</span><span class="w"> </span><span class="k">TABLE</span><span class="w"> </span><span class="k">IF</span><span class="w"> </span><span class="k">NOT</span><span class="w"> </span><span class="k">EXISTS</span><span class="w"> </span><span class="n">documentos</span><span class="w"> </span><span class="p">(</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">   </span><span class="n">id</span><span class="w"> </span><span class="nb">SERIAL</span><span class="w"> </span><span class="k">PRIMARY</span><span class="w"> </span><span class="k">KEY</span><span class="p">,</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">   </span><span class="n">titulo</span><span class="w"> </span><span class="nb">TEXT</span><span class="w"> </span><span class="k">NOT</span><span class="w"> </span><span class="k">NULL</span><span class="p">,</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">   </span><span class="n">conteudo</span><span class="w"> </span><span class="nb">TEXT</span><span class="p">,</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">   </span><span class="n">categoria</span><span class="w"> </span><span class="nb">TEXT</span><span class="p">,</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">   </span><span class="n">data_criacao</span><span class="w"> </span><span class="k">TIMESTAMP</span><span class="w"> </span><span class="k">DEFAULT</span><span class="w"> </span><span class="k">CURRENT_TIMESTAMP</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="p">);</span></span></span></code></pre></div>
</div>
<p>
Neste exemplo, criamos uma tabela chamada <code>documentos</code> com quatro colunas: <code>id</code>, <code>titulo</code>, <code>conteudo</code> e <code>categoria</code>. É importante notar que a coluna <code>id</code> é a chave primária da tabela. Outro ponto importante é que a coluna <code>data_criacao</code> é uma coluna de metadados que é gerada automaticamente pelo PostgreSQL.</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-4">
<h4 id="headline-6">
3. Inserindo Documentos
</h4>
<div id="outline-text-headline-6" class="outline-text-4">
<p>
Podemos inserir documentos manualmente ou usar a função <code>ai.load_dataset</code> do <a href="https://github.com/timescale/pgai">pgai</a> para carregar dados diretamente do <a href="https://huggingface.co/">Hugging Face</a>:</p>
<div class="src src-sql">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-sql" data-lang="sql"><span class="line"><span class="cl"><span class="k">SELECT</span><span class="w"> </span><span class="n">ai</span><span class="p">.</span><span class="n">load_dataset</span><span class="p">(</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">   </span><span class="n">name</span><span class="w"> </span><span class="o">=&gt;</span><span class="w"> </span><span class="s1">&#39;Cohere/movies&#39;</span><span class="p">,</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">   </span><span class="k">table_name</span><span class="w"> </span><span class="o">=&gt;</span><span class="w"> </span><span class="s1">&#39;documentos&#39;</span><span class="p">,</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">   </span><span class="n">if_table_exists</span><span class="w"> </span><span class="o">=&gt;</span><span class="w"> </span><span class="s1">&#39;append&#39;</span><span class="p">,</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">   </span><span class="n">field_types</span><span class="w"> </span><span class="o">=&gt;</span><span class="w"> </span><span class="s1">&#39;{&#34;title&#34;: &#34;titulo&#34;, &#34;overview&#34;: &#34;conteudo&#34;, &#34;genres&#34;: &#34;categoria&#34;}&#39;</span><span class="p">::</span><span class="n">jsonb</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="p">);</span></span></span></code></pre></div>
</div>
<p>
Alternativamente, podemos inserir registros manualmente:</p>
<div class="src src-sql">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-sql" data-lang="sql"><span class="line"><span class="cl"><span class="k">INSERT</span><span class="w"> </span><span class="k">INTO</span><span class="w"> </span><span class="n">documentos</span><span class="w"> </span><span class="p">(</span><span class="n">titulo</span><span class="p">,</span><span class="w"> </span><span class="n">conteudo</span><span class="p">,</span><span class="w"> </span><span class="n">categoria</span><span class="p">)</span><span class="w"> </span><span class="k">VALUES</span><span class="w"> 
</span></span></span><span class="line"><span class="cl"><span class="p">(</span><span class="s1">&#39;Guia Clojure&#39;</span><span class="p">,</span><span class="w"> </span><span class="s1">&#39;Clojure é uma linguagem funcional moderna...&#39;</span><span class="p">,</span><span class="w"> </span><span class="s1">&#39;Programação&#39;</span><span class="p">),</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="p">(</span><span class="s1">&#39;Tutorial RAG&#39;</span><span class="p">,</span><span class="w"> </span><span class="s1">&#39;Sistemas RAG combinam busca e geração...&#39;</span><span class="p">,</span><span class="w"> </span><span class="s1">&#39;IA&#39;</span><span class="p">),</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="p">(</span><span class="s1">&#39;PostgreSQL Avançado&#39;</span><span class="p">,</span><span class="w"> </span><span class="s1">&#39;Técnicas de otimização para PostgreSQL...&#39;</span><span class="p">,</span><span class="w"> </span><span class="s1">&#39;Banco de Dados&#39;</span><span class="p">);</span></span></span></code></pre></div>
</div>
<blockquote>
<p><em>NOTA</em>: O <a href="https://huggingface.co/">Hugging Face</a> é uma plataforma de dados e modelos de IA.</p>
</blockquote>
<p>
Agora vamos configurar o vectorizer para gerar embeddings automaticamente.</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-4">
<h4 id="headline-7">
4. Configurando o Vectorizer
</h4>
<div id="outline-text-headline-7" class="outline-text-4">
<p>
O <a href="https://github.com/timescale/pgai">pgai</a> inclui uma ferramenta chamada <a href="https://github.com/timescale/pgai/tree/main/vectorizer">vectorizer</a> que automatiza a criação e sincronização de embeddings. Esta é uma das funcionalidades mais poderosas desta solução, pois elimina a necessidade de ferramentas externas para criar <a href="https://en.wikipedia.org/wiki/Embedding_(machine_learning">embeddings</a>). Vamos configurá-la:</p>
<div class="src src-sql">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-sql" data-lang="sql"><span class="line"><span class="cl"><span class="k">SELECT</span><span class="w"> </span><span class="n">ai</span><span class="p">.</span><span class="n">create_vectorizer</span><span class="p">(</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">   </span><span class="s1">&#39;public.documentos&#39;</span><span class="p">::</span><span class="n">regclass</span><span class="p">,</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">   </span><span class="n">destination</span><span class="w"> </span><span class="o">=&gt;</span><span class="w"> </span><span class="s1">&#39;documentos_embeddings&#39;</span><span class="p">,</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">   </span><span class="n">embedding</span><span class="w"> </span><span class="o">=&gt;</span><span class="w"> </span><span class="n">ai</span><span class="p">.</span><span class="n">embedding_ollama</span><span class="p">(</span><span class="s1">&#39;nomic-embed-text&#39;</span><span class="p">,</span><span class="w"> </span><span class="mi">768</span><span class="p">),</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">   </span><span class="n">chunking</span><span class="w"> </span><span class="o">=&gt;</span><span class="w"> </span><span class="n">ai</span><span class="p">.</span><span class="n">chunking_recursive_character_text_splitter</span><span class="p">(</span><span class="s1">&#39;conteudo&#39;</span><span class="p">)</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="p">);</span></span></span></code></pre></div>
</div>
<p>
Basicamente, o comando acima faz o seguinte:</p>
<ol>
<li>Cria uma tabela <code>documentos_embeddings</code> para armazenar os vetores</li>
<li>Configura o modelo <code>nomic-embed-text</code> via Ollama para gerar embeddings</li>
<li>Define uma estratégia de chunking para dividir textos longos</li>
<li>Cria automaticamente uma view <code>documentos_embeddings_vectorized</code> que junta os documentos com seus embeddings</li>
</ol>
<p>O <a href="https://github.com/timescale/pgai/tree/main/vectorizer">vectorizer</a> também cuida da sincronização automática dos embeddings quando documentos são inseridos, atualizados ou removidos - sem necessidade de código adicional! Isto simplifica enormemente a manutenção do sistema.</p>
</div>
</div>
