blog/content/post/semantic-postgresql.org
*** 5. Realizando Busca Semântica

Agora estamos prontos para realizar buscas semânticas. Usaremos a função ~ai.ollama_embed~ para gerar embeddings para nossa consulta e o operador de distância de cosseno (~<=>~) para encontrar documentos similares:

#+BEGIN_SRC sql
WITH query_embedding AS (
    -- Gerar embedding para a consulta
    SELECT ai.ollama_embed('nomic-embed-text', 'Como implementar RAG em sistemas modernos', 
                          host => 'http://ollama:11434') AS embedding
)
SELECT
    d.titulo,
    d.conteudo,
    d.categoria,
    t.embedding <=> (SELECT embedding FROM query_embedding) AS distancia
FROM documentos_embeddings t
LEFT JOIN documentos d ON t.id = d.id
ORDER BY distancia
LIMIT 5;
#+END_SRC

Este código SQL realiza uma [[https://en.wikipedia.org/wiki/Semantic_search][busca semântica]] em nossa base de documentos utilizando [[https://en.wikipedia.org/wiki/Embedding_(machine_learning][embeddings]]) gerados pelo modelo ~nomic-embed-text~ através do [[https://ollama.com/][Ollama]]. Primeiro, criamos uma CTE (Common Table Expression) chamada ~query_embedding~ que gera o embedding para nossa consulta "Como implementar RAG em sistemas modernos". Em seguida, selecionamos os documentos mais relevantes comparando este embedding de consulta com os embeddings armazenados na tabela ~documentos_embeddings~ usando o operador de distância de cosseno (~<=>~).

O resultado é uma lista ordenada dos documentos mais semanticamente similares à nossa consulta, independentemente de compartilharem as mesmas palavras exatas. Esta é a essência da busca semântica - encontrar conteúdo conceitualmente relacionado, não apenas correspondências de palavras-chave. A coluna ~distancia~ nos mostra quão próximo cada documento está da nossa consulta, com valores menores indicando maior similaridade. Limitamos os resultados aos 5 documentos mais relevantes, mas este número pode ser ajustado conforme necessário. O PostgreSQL oferece três operadores para cálculo de similaridade:

- ~<->~: [[https://en.wikipedia.org/wiki/Euclidean_distance][Distância L2 (Euclidiana)]]
- ~<#>~: [[https://en.wikipedia.org/wiki/Dot_product][Produto interno]]
- ~<=>~: [[https://en.wikipedia.org/wiki/Cosine_distance][Distância de cosseno]] (geralmente a melhor opção)

E pronto! Com apenas esses poucos passos, temos um sistema de busca semântica totalmente funcional, diretamente no PostgreSQL. /[[/post/rag/][Para quem acompanhou o artigo anterior sobre a implementação de RAG em Clojure]]/, vale a pena comparar as duas abordagens:

A diferença entre as duas abordagens é bem clara quando olhamos lado a lado. [[/post/rag/][No artigo anterior sobre RAG em Clojure]], usamos uma técnica mais simples [[/post/tf-idf/][(TF-IDF)]] que funciona bem para projetos pequenos e didáticos. É como usar uma bicicleta para se locomover para distâncias curtas. O código em Clojure mantém tudo em memória, o que é ótimo para aprender os conceitos, mas começa a dar problema quando a quantidade de documentos cresce.

Já a abordagem com PostgreSQL + pgai é como trocar a bicicleta por um carro esportivo! Estamos usando embeddings densos gerados por LLMs, que capturam muito melhor o significado semântico dos textos. O PostgreSQL cuida de toda a parte chata de persistência e indexação, permitindo que você escale para milhões de documentos sem suar. Os índices especializados para vetores (como HNSW) fazem buscas em bilhões de embeddings parecerem instantâneas, algo que nossa implementação anterior jamais conseguiria.

O mais legal é que a manutenção fica muito mais simples. Com o [[https://github.com/timescale/pgai/tree/main/vectorizer][vectorizer do pgai]], você só precisa inserir documentos no banco normalmente, e ele cuida automaticamente de gerar e atualizar os embeddings. 


-----

