semantic-postgresql/index.html
<div id="outline-container-headline-9" class="outline-3">
<h3 id="headline-9">
Integração com Clojure
</h3>
<div id="outline-text-headline-9" class="outline-text-3">
<p>
O objetivo deste artigo é mostrar como é fácil construir um sistema de busca semântica usando PostgreSQL e pgai. No entanto, é mostrar também como podemos evoluir à proposta anterior e construir um sistema de busca semântica mais robusto e escalável usando PostgreSQL e pgai e Clojure.</p>
<div class="src src-clojure">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-clojure" data-lang="clojure"><span class="line"><span class="cl"><span class="c1">;; src/docai/pg.clj</span>
</span></span><span class="line"><span class="cl"><span class="p">(</span><span class="kd">ns </span><span class="nv">docai.pg</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="ss">:require</span> <span class="p">[</span><span class="nv">next.jdbc</span> <span class="ss">:as</span> <span class="nv">jdbc</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">            <span class="p">[</span><span class="nv">clojure.data.json</span> <span class="ss">:as</span> <span class="nv">json</span><span class="p">]))</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="p">(</span><span class="k">def </span><span class="nv">db-spec</span>
</span></span><span class="line"><span class="cl">  <span class="p">{</span><span class="ss">:dbtype</span> <span class="s">&#34;postgresql&#34;</span>
</span></span><span class="line"><span class="cl">   <span class="ss">:dbname</span> <span class="s">&#34;postgres&#34;</span>
</span></span><span class="line"><span class="cl">   <span class="ss">:host</span> <span class="s">&#34;localhost&#34;</span>
</span></span><span class="line"><span class="cl">   <span class="ss">:user</span> <span class="s">&#34;postgres&#34;</span>
</span></span><span class="line"><span class="cl">   <span class="ss">:password</span> <span class="s">&#34;password&#34;</span><span class="p">})</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="p">(</span><span class="kd">defn </span><span class="nv">query-semantic-search</span>
</span></span><span class="line"><span class="cl">  <span class="s">&#34;Realiza busca semântica via PostgreSQL&#34;</span>
</span></span><span class="line"><span class="cl">  <span class="p">[</span><span class="nv">query</span> <span class="nv">limit</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="k">let </span><span class="p">[</span><span class="nv">conn</span> <span class="p">(</span><span class="nf">jdbc/get-connection</span> <span class="nv">db-spec</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="nv">sql</span> <span class="p">(</span><span class="nb">str </span><span class="s">&#34;WITH query_embedding AS (&#34;</span>
</span></span><span class="line"><span class="cl">                 <span class="s">&#34;  SELECT ai.ollama_embed(&#39;nomic-embed-text&#39;, ?, host =&gt; &#39;http://ollama:11434&#39;) AS embedding&#34;</span>
</span></span><span class="line"><span class="cl">                 <span class="s">&#34;)&#34;</span>
</span></span><span class="line"><span class="cl">                 <span class="s">&#34;SELECT&#34;</span>
</span></span><span class="line"><span class="cl">                 <span class="s">&#34;  d.titulo,&#34;</span>
</span></span><span class="line"><span class="cl">                 <span class="s">&#34;  d.conteudo,&#34;</span>
</span></span><span class="line"><span class="cl">                 <span class="s">&#34;  d.categoria,&#34;</span>
</span></span><span class="line"><span class="cl">                 <span class="s">&#34;  t.embedding &lt;=&gt; (SELECT embedding FROM query_embedding) AS distancia&#34;</span>
</span></span><span class="line"><span class="cl">                 <span class="s">&#34; FROM documentos_embeddings t&#34;</span>
</span></span><span class="line"><span class="cl">                 <span class="s">&#34; LEFT JOIN documentos d ON t.id = d.id&#34;</span>
</span></span><span class="line"><span class="cl">                 <span class="s">&#34; ORDER BY distancia&#34;</span>
</span></span><span class="line"><span class="cl">                 <span class="s">&#34; LIMIT ?&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="nv">results</span> <span class="p">(</span><span class="nf">jdbc/execute!</span> <span class="nv">conn</span> <span class="p">[</span><span class="nv">sql</span> <span class="nv">query</span> <span class="nv">limit</span><span class="p">])]</span>
</span></span><span class="line"><span class="cl">    <span class="nv">results</span><span class="p">))</span></span></span></code></pre></div>
</div>
<blockquote>
<p><em>NOTA</em>: O código acima é um exemplo de como integrar a busca semântica no PostgreSQL com uma aplicação Clojure. O código completo está disponível no <a href="https://github.com/lobovit/docai"><a href="https://github.com/lobovit/docai">https://github.com/lobovit/docai</a></a>.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-10" class="outline-3">
<h3 id="headline-10">
Configuração de Contêineres e Resolução de Problemas
</h3>
<div id="outline-text-headline-10" class="outline-text-3">
<p>
Ao trabalhar com contêineres Docker ou Podman, você pode encontrar alguns desafios específicos relacionados à comunicação entre serviços. Vamos explorar algumas dicas para garantir que sua configuração funcione sem problemas:</p>
<div id="outline-container-headline-11" class="outline-4">
<h4 id="headline-11">
Nomeação de Contêineres e Comunicação entre Serviços
</h4>
<div id="outline-text-headline-11" class="outline-text-4">
<p>
Quando os serviços estão em contêineres separados, a comunicação entre eles pode ser complicada. Existem várias maneiras de referenciar um contêiner a partir de outro:</p>
<div class="src src-clojure">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-clojure" data-lang="clojure"><span class="line"><span class="cl"><span class="c1">;; Exemplo de diferentes URLs para alcançar o serviço Ollama</span>
</span></span><span class="line"><span class="cl"><span class="p">(</span><span class="k">def </span><span class="nv">alternative-hosts</span> 
</span></span><span class="line"><span class="cl">  <span class="p">[</span><span class="s">&#34;http://pgai-ollama-1:11434&#34;</span>    <span class="c1">;; Nome do contêiner específico (mais confiável)</span>
</span></span><span class="line"><span class="cl">   <span class="s">&#34;http://ollama:11434&#34;</span>           <span class="c1">;; Nome do serviço (conforme definido no arquivo docker/podman-compose)</span>
</span></span><span class="line"><span class="cl">   <span class="s">&#34;http://172.18.0.2:11434&#34;</span>       <span class="c1">;; IP do contêiner (pode mudar entre reinicializações)</span>
</span></span><span class="line"><span class="cl">   <span class="s">&#34;http://host.docker.internal:11434&#34;</span> <span class="c1">;; Especial para acessar o host a partir do contêiner</span>
</span></span><span class="line"><span class="cl">   <span class="s">&#34;http://localhost:11434&#34;</span><span class="p">])</span>      <span class="c1">;; Funciona apenas se mapeado para a porta do host</span></span></span></code></pre></div>
</div>
<p>
O método mais confiável é usar o nome exato do contêiner (algo como <code>pgai-ollama-1</code>), que pode ser descoberto com o comando <code>docker ps</code> ou <code>podman ps</code>.</p>
</div>
</div>
