semantic-postgresql/index.html
<div id="outline-container-headline-12" class="outline-4">
<h4 id="headline-12">
Solução de Problemas de Conexão
</h4>
<div id="outline-text-headline-12" class="outline-text-4">
<p>
Se você estiver enfrentando problemas de conexão, uma abordagem robusta é implementar um sistema de fallback que tente diferentes URLs:</p>
<div class="src src-clojure">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-clojure" data-lang="clojure"><span class="line"><span class="cl"><span class="p">(</span><span class="kd">defn </span><span class="nv">call-ollama-api</span>
</span></span><span class="line"><span class="cl">  <span class="s">&#34;Chama a API do Ollama com múltiplas tentativas de conexão&#34;</span>
</span></span><span class="line"><span class="cl">  <span class="p">[</span><span class="nv">prompt</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="k">let </span><span class="p">[</span><span class="nv">primary-url</span> <span class="s">&#34;http://ollama:11434/api/generate&#34;</span>
</span></span><span class="line"><span class="cl">        <span class="nv">options</span> <span class="p">{</span><span class="ss">:headers</span> <span class="p">{</span><span class="s">&#34;Content-Type&#34;</span> <span class="s">&#34;application/json&#34;</span><span class="p">}</span>
</span></span><span class="line"><span class="cl">                 <span class="ss">:body</span> <span class="p">(</span><span class="nf">json/write-str</span> <span class="p">{</span><span class="ss">:model</span> <span class="s">&#34;deepseek-r1&#34;</span>
</span></span><span class="line"><span class="cl">                                       <span class="ss">:prompt</span> <span class="nv">prompt</span><span class="p">})}</span>
</span></span><span class="line"><span class="cl">        
</span></span><span class="line"><span class="cl">        <span class="c1">;; Tentar primeiro com a URL primária</span>
</span></span><span class="line"><span class="cl">        <span class="nv">primary-result</span> <span class="p">(</span><span class="nf">try-single-url</span> <span class="nv">primary-url</span> <span class="nv">options</span><span class="p">)]</span>
</span></span><span class="line"><span class="cl">    
</span></span><span class="line"><span class="cl">    <span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="ss">:success</span> <span class="nv">primary-result</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">      <span class="p">(</span><span class="ss">:result</span> <span class="nv">primary-result</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">      <span class="p">(</span><span class="nf">do</span>
</span></span><span class="line"><span class="cl">        <span class="p">(</span><span class="nb">println </span><span class="s">&#34;⚠️ Erro na chamada primária, tentando URLs alternativas...&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        
</span></span><span class="line"><span class="cl">        <span class="c1">;; Tentar URLs alternativas</span>
</span></span><span class="line"><span class="cl">        <span class="p">(</span><span class="k">let </span><span class="p">[</span><span class="nv">alternative-hosts</span> <span class="p">[</span><span class="s">&#34;http://pgai-ollama-1:11434&#34;</span> 
</span></span><span class="line"><span class="cl">                                <span class="s">&#34;http://172.18.0.2:11434&#34;</span> 
</span></span><span class="line"><span class="cl">                                <span class="s">&#34;http://host.docker.internal:11434&#34;</span> 
</span></span><span class="line"><span class="cl">                                <span class="s">&#34;http://localhost:11434&#34;</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">              <span class="nv">successful-result</span> <span class="p">(</span><span class="nb">some </span><span class="p">(</span><span class="k">fn </span><span class="p">[</span><span class="nv">host</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">                                       <span class="p">(</span><span class="k">let </span><span class="p">[</span><span class="nv">alt-url</span> <span class="p">(</span><span class="nb">str </span><span class="nv">host</span> <span class="s">&#34;/api/generate&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">                                             <span class="nv">result</span> <span class="p">(</span><span class="nf">try-single-url</span> <span class="nv">alt-url</span> <span class="nv">options</span><span class="p">)]</span>
</span></span><span class="line"><span class="cl">                                         <span class="p">(</span><span class="nb">when </span><span class="p">(</span><span class="ss">:success</span> <span class="nv">result</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">                                           <span class="p">(</span><span class="nb">println </span><span class="s">&#34;✅ Conexão bem-sucedida com&#34;</span> <span class="nv">alt-url</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">                                           <span class="p">(</span><span class="ss">:result</span> <span class="nv">result</span><span class="p">))))</span>
</span></span><span class="line"><span class="cl">                                     <span class="nv">alternative-hosts</span><span class="p">)]</span>
</span></span><span class="line"><span class="cl">          <span class="p">(</span><span class="nb">or </span><span class="nv">successful-result</span>
</span></span><span class="line"><span class="cl">              <span class="p">(</span><span class="nb">str </span><span class="s">&#34;Não foi possível conectar ao Ollama usando nenhum dos endpoints disponíveis.&#34;</span><span class="p">)))))))</span></span></span></code></pre></div>
</div>
<p>
Esta abordagem tenta vários endpoints diferentes e usa o primeiro que funcionar. A função <code>call-ollama-api</code> primeiro tenta se conectar a uma URL primária e, caso falhe, percorre uma lista de URLs alternativas até encontrar uma conexão bem-sucedida. Para cada tentativa, ela utiliza a função auxiliar <code>try-single-url</code> que encapsula a lógica de tratamento de erros.</p>
<p>
A implementação segue um padrão de fallback, onde a função retorna o resultado da primeira conexão bem-sucedida ou uma mensagem de erro caso todas as tentativas falhem. Este método é particularmente útil em ambientes containerizados, onde os endereços de rede podem variar dependendo da configuração do <a href="https://www.docker.com/">Docker</a> ou <a href="https://podman.io/">Podman</a> e da rede interna, garantindo maior resiliência à aplicação.</p>
<p>
Acessando <a href="https://github.com/lobovit/docai"><a href="https://github.com/lobovit/docai">https://github.com/lobovit/docai</a></a>, você pode ver o código completo e testar a aplicação. Ao executar por exemplo <code>./run.bat postgres</code> temos o seguinte output:</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-bash" data-lang="bash"><span class="line"><span class="cl">Inicializando DocAI...
</span></span><span class="line"><span class="cl">Modo PostgreSQL ativado!
</span></span><span class="line"><span class="cl">ℹ️ Para usar o Ollama, certifique-se de que ele está em execução com o comando: ollama serve
</span></span><span class="line"><span class="cl">ℹ️ Usando o modelo deepseek-r1. Se você ainda não o baixou, execute: ollama pull deepseek-r1
</span></span><span class="line"><span class="cl">Configurando ambiente PostgreSQL para RAG...
</span></span><span class="line"><span class="cl">✅ Configurado para usar Ollama dentro <span class="k">do</span> contêiner Docker/Podman
</span></span><span class="line"><span class="cl">🚀 Configurando PostgreSQL para RAG...
</span></span><span class="line"><span class="cl">✅ Extensões vector e ai habilitadas com sucesso
</span></span><span class="line"><span class="cl">✅ Tabela de documentos criada com sucesso
</span></span><span class="line"><span class="cl">✅ Configurado para usar Ollama dentro <span class="k">do</span> contêiner Docker/Podman
</span></span><span class="line"><span class="cl">✅ Vectorizer já configurado <span class="o">(</span>tabela documentos_embeddings já existe<span class="o">)</span>
</span></span><span class="line"><span class="cl">Importando documentos para o PostgreSQL...
</span></span><span class="line"><span class="cl">✅ Documento inserido com ID: <span class="m">5</span>
</span></span><span class="line"><span class="cl">✅ Arquivo importado com sucesso: resources<span class="se">\d</span>ocs<span class="se">\e</span>xample.md
</span></span><span class="line"><span class="cl">PostgreSQL RAG pronto! Faça sua pergunta:
</span></span><span class="line"><span class="cl">Como implementar JWT em Clojure?
</span></span><span class="line"><span class="cl">Processando...
</span></span><span class="line"><span class="cl">DEBUG - Processando query no PostgreSQL: Como implementar JWT em Clojure?
</span></span><span class="line"><span class="cl">DEBUG - Detectada consulta relacionada a JWT, usando busca especial
</span></span><span class="line"><span class="cl">DEBUG - Encontrados <span class="m">5</span> documentos relacionados a JWT
</span></span><span class="line"><span class="cl">DEBUG - Enviando prompt para o Ollama usando o modelo deepseek-r1
</span></span><span class="line"><span class="cl">DEBUG - Tamanho <span class="k">do</span> prompt após truncamento: <span class="m">4442</span> caracteres
</span></span><span class="line"><span class="cl">DEBUG - Usando URL <span class="k">do</span> Ollama: http://ollama:11434/api/generate
</span></span><span class="line"><span class="cl">⚠️ Erro na chamada primária: Erro ao chamar a API <span class="k">do</span> Ollama:  - 
</span></span><span class="line"><span class="cl">🔄 Tentando URLs alternativas...
</span></span><span class="line"><span class="cl">🔄 Tentando conectar ao Ollama em http://pgai-ollama-1:11434/api/generate
</span></span><span class="line"><span class="cl">⚠️ Erro ao chamar a API <span class="k">do</span> Ollama:  Erro ao chamar a API <span class="k">do</span> Ollama:  - 
</span></span><span class="line"><span class="cl">🔄 Tentando conectar ao Ollama em http://172.18.0.2:11434/api/generate
</span></span><span class="line"><span class="cl">⚠️ Erro ao chamar a API <span class="k">do</span> Ollama:  Erro ao chamar a API <span class="k">do</span> Ollama:  - 
</span></span><span class="line"><span class="cl">🔄 Tentando conectar ao Ollama em http://host.docker.internal:11434/api/generate
</span></span><span class="line"><span class="cl">⚠️ Erro ao chamar a API <span class="k">do</span> Ollama:  Erro ao chamar a API <span class="k">do</span> Ollama:  - 
</span></span><span class="line"><span class="cl">🔄 Tentando conectar ao Ollama em http://localhost:11434/api/generate
</span></span><span class="line"><span class="cl">✅ Conexão bem-sucedida com http://localhost:11434/api/generate
</span></span><span class="line"><span class="cl">&lt;think&gt;
</span></span><span class="line"><span class="cl">Primeiro, preciso entender como a implementação de JWT em Clojure está relacionada com a integração <span class="k">do</span> Ollama. Sabemos que o documento aborda a criação de tokens JWT usando a biblioteca <span class="sb">`</span>buddy.sign.jwt<span class="sb">`</span> e a manipulação de chaves privadas com <span class="sb">`</span>clojure.java.security<span class="sb">`</span>. Além disso, é usada a biblioteca <span class="sb">`</span>http-kit<span class="sb">`</span> para interação HTTP com o Ollama.
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">Vou começar analisando os passos necessários para criar um token JWT. Primeiro, é preciso definir os claims que compreendem informações como ID <span class="k">do</span> usuário, nome de usuário e roles. Em seguida, associar um secret key ao token. No documento, há exemplos de como usar uma string secreta ou chaves assimétricas. 
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">A seguir, entendo que é necessário configurar as dependências no arquivo <span class="sb">`</span>project.clj<span class="sb">`</span> para incluir as bibliotecas necessárias: <span class="sb">`</span>buddy/sign<span class="sb">`</span> e <span class="sb">`</span>http-kit<span class="sb">`</span>. Também é importante garantir que o Ollama esteja rodando com a comando adequado para pulling os modelos e executar as inferências.
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">Para testar, seria útil executar uma requisição POST para /login usando curl, passando os dados de login como JSON. Depois, usar o token obtido na requisição POST para /rag/query, Including o campo Authorization com o Bearer <span class="k">do</span> token.
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">Além disso, devo considerar como lidar com as funções de Wrapping em Clojure para garantir que as requisições HTTP sejam encadeadas corretamente. Talvez seja útil estabelecer uma rotina de login que gera o token e a envia, seguida de usar esse token nas consultas RAG.
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">Finalmente, tenho que lidar com possíveis erros, como se o Ollama não está executando ou houver problemas de autenticação. É importante inspecionar os logs e verificar as respostas das requisições HTTP para entender quais erros estiverem ocorrendo.
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">No final, vou needear a documentação officially para confirmar se há mais funcionalidades disponíveis que posso explorar após a implementação básica de JWT.
</span></span><span class="line"><span class="cl">&lt;/think&gt;
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">Para implementar a autenticação com JWT em Clojure juntamente com a integração <span class="k">do</span> Ollama, siga os passos abaixo. Isso permitirá que você utilize tokens JWT para proteger suas requisições RAG.
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1">### Passo 1: Configurar as dependências</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">Adicione as seguintes dependências ao seu <span class="sb">`</span>project.clj<span class="sb">`</span>:
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="o">[</span>buddy/sign <span class="s2">&#34;3.4.0&#34;</span><span class="o">]</span>    <span class="p">;</span> Para geração de signatures e verificação de validade
</span></span><span class="line"><span class="cl"><span class="o">[</span>buddy/auth <span class="s2">&#34;2.6.1&#34;</span><span class="o">]</span>     <span class="p">;</span> Para funções de autenticação
</span></span><span class="line"><span class="cl"><span class="o">[</span>http-kit <span class="s2">&#34;2.6.0&#34;</span><span class="o">]</span>      <span class="p">;</span> Para manipulação de requisições HTTP
</span></span><span class="line"><span class="cl"><span class="o">[</span>buddy.core.keys :as keys<span class="o">]</span>  <span class="p">;</span> Para geração de chaves privadas
</span></span><span class="line"><span class="cl"><span class="o">[</span>buddy.data.json :as json<span class="o">]</span>  <span class="p">;</span> Para processamento JSON</span></span></code></pre></div>
</div>
<p>
Sucesso total!
Temos um sistema de busca semântica com PostgreSQL, pgvector, pgai e Ollama em Clojure funcionando! 🎉</p>
<p>
Este projeto de busca semântica com PostgreSQL pode ser expandido de várias maneiras interessantes. Uma possibilidade é implementar um sistema de feedback do usuário que capture as interações e avaliações das respostas geradas, permitindo o refinamento contínuo dos resultados. Isso poderia ser feito adicionando uma tabela <code>feedback_usuarios</code> que registre a consulta original, a resposta fornecida e a avaliação do usuário (positiva ou negativa). Esses dados poderiam então ser utilizados para ajustar os parâmetros de similaridade ou até mesmo para treinar um modelo de reranking que melhore a relevância dos resultados ao longo do tempo.</p>
<p>
Outra expansão valiosa seria a integração com fontes de dados externas em tempo real. Por exemplo, poderíamos criar um sistema de ingestão automática que monitore feeds RSS, APIs ou repositórios Git específicos, extraindo novos conteúdos periodicamente e atualizando nossa base de conhecimento. Isso manteria o sistema sempre atualizado com as informações mais recentes, especialmente útil em domínios que evoluem rapidamente como tecnologia e ciência. A implementação poderia utilizar workers assíncronos em Clojure que processam novas entradas em background, vetorizam o conteúdo e o inserem automaticamente no PostgreSQL sem interrupção do serviço principal. Muito legal não é?</p>
<hr>
</div>
</div>
