blog/content/post/semantic-postgresql.org
*** Persistência de Modelos entre Reinicializações

Um problema comum ao trabalhar com Ollama em contêineres é que os modelos são baixados repetidamente quando os contêineres são recriados. Para evitar isso:

1. Use volumes para armazenar os dados do Ollama:
#+BEGIN_SRC yaml
   volumes:
     ollama_data:/root/.ollama
#+END_SRC

2. Ao parar os contêineres, evite remover os volumes:
#+BEGIN_SRC bash
   # Incorreto (remove volumes)
   docker compose down --volumes
   
   # Correto (preserva volumes)
   docker compose down
#+END_SRC

3. Implemente verificações antes de baixar modelos:
#+BEGIN_SRC bash
   # Verificar se o modelo já existe antes de baixá-lo
   docker exec pgai-ollama-1 ollama list | grep "nomic-embed-text" > /dev/null
   if [ $? -ne 0 ]; then
     echo "Baixando modelo nomic-embed-text..."
     docker exec pgai-ollama-1 ollama pull nomic-embed-text
   else
     echo "Modelo nomic-embed-text já está disponível"
   fi
#+END_SRC

Seguindo essas práticas, você economizará largura de banda e tempo, além de melhorar significativamente a experiência do usuário.

*** Buscas Especializadas para Tópicos Específicos

Ao implementar seu sistema RAG, considere adicionar rotas especializadas de busca para certos tópicos. Por exemplo, se seu sistema precisa responder bem a consultas sobre JWT (JSON Web Tokens):

#+BEGIN_SRC clojure
(defn query-pg-rag
  "Processa uma consulta com tratamento especial para certos tópicos"
  [query]
  ;; Verificar primeiro se é uma consulta relacionada a JWT
  (let [lower-query (str/lower-case query)
        jwt-keywords ["jwt" "token" "autenticação"]]
    
    (if (some #(str/includes? lower-query %) jwt-keywords)
      ;; Busca especializada para JWT usando SQL direto
      (let [conn (jdbc/get-connection db-spec)
            docs (jdbc/execute! 
                   conn 
                   ["SELECT id, titulo, conteudo FROM documentos 
                     WHERE LOWER(conteudo) LIKE ? LIMIT 5"
                    "%jwt%"])]
        ;; Processar resultados específicos de JWT...
        )
      
      ;; Busca semântica padrão para outros tópicos
      (semantic-search query 5))))
#+END_SRC

Esta abordagem híbrida combina busca por palavras-chave para tópicos específicos com busca semântica para consultas gerais, melhorando a precisão global do sistema.

-----

** Conclusão

Neste artigo, exploramos como construir um sistema de busca semântica robusto usando PostgreSQL, pgvector, pgai e Ollama. Esta abordagem não só oferece melhor precisão em comparação com métodos tradicionais baseados em palavras-chave, mas também é altamente escalável e adequada para ambientes de produção.

Vimos como configurar o ambiente usando Docker/Podman, como lidar com desafios comuns de comunicação entre contêineres, e implementamos estratégias para manter a persistência de modelos e melhorar a experiência do usuário. A combinação de busca semântica com técnicas específicas para tópicos especiais, como JWT, demonstra a flexibilidade desta abordagem.

Para quem já trabalhou com RAG usando abordagens mais simples, como TF-IDF, esta implementação representa um salto significativo em termos de capacidades, mantendo a simplicidade operacional graças às ferramentas modernas que utilizamos.

Quer saber mais sobre como implementar sistemas RAG avançados em seus projetos? Confira nossos outros artigos sobre o assunto e experimente o código completo disponível no [[https://github.com/lobovit/docai][repositório do DocAI]]. Estamos ansiosos para ver o que você vai construir!

-----

