semantic-postgresql/index.html
<div id="outline-container-headline-13" class="outline-4">
<h4 id="headline-13">
Persistência de Modelos entre Reinicializações
</h4>
<div id="outline-text-headline-13" class="outline-text-4">
<p>
Um problema comum ao trabalhar com Ollama em contêineres é que os modelos são baixados repetidamente quando os contêineres são recriados. Para evitar isso:</p>
<ol>
<li>Use volumes para armazenar os dados do Ollama:</li>
</ol>
<div class="src src-yaml">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-yaml" data-lang="yaml"><span class="line"><span class="cl"><span class="w">   </span><span class="nt">volumes</span><span class="p">:</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">     </span><span class="l">ollama_data:/root/.ollama</span></span></span></code></pre></div>
</div>
<ol>
<li>Ao parar os contêineres, evite remover os volumes:</li>
</ol>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-bash" data-lang="bash"><span class="line"><span class="cl">   <span class="c1"># Incorreto (remove volumes)</span>
</span></span><span class="line"><span class="cl">   docker compose down --volumes
</span></span><span class="line"><span class="cl">   
</span></span><span class="line"><span class="cl">   <span class="c1"># Correto (preserva volumes)</span>
</span></span><span class="line"><span class="cl">   docker compose down</span></span></code></pre></div>
</div>
<ol>
<li>Implemente verificações antes de baixar modelos:</li>
</ol>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-bash" data-lang="bash"><span class="line"><span class="cl">   <span class="c1"># Verificar se o modelo já existe antes de baixá-lo</span>
</span></span><span class="line"><span class="cl">   docker <span class="nb">exec</span> pgai-ollama-1 ollama list <span class="p">|</span> grep <span class="s2">&#34;nomic-embed-text&#34;</span> &gt; /dev/null
</span></span><span class="line"><span class="cl">   <span class="k">if</span> <span class="o">[</span> <span class="nv">$?</span> -ne <span class="m">0</span> <span class="o">]</span><span class="p">;</span> <span class="k">then</span>
</span></span><span class="line"><span class="cl">     <span class="nb">echo</span> <span class="s2">&#34;Baixando modelo nomic-embed-text...&#34;</span>
</span></span><span class="line"><span class="cl">     docker <span class="nb">exec</span> pgai-ollama-1 ollama pull nomic-embed-text
</span></span><span class="line"><span class="cl">   <span class="k">else</span>
</span></span><span class="line"><span class="cl">     <span class="nb">echo</span> <span class="s2">&#34;Modelo nomic-embed-text já está disponível&#34;</span>
</span></span><span class="line"><span class="cl">   <span class="k">fi</span></span></span></code></pre></div>
</div>
<p>
Seguindo essas práticas, você economizará largura de banda e tempo, além de melhorar significativamente a experiência do usuário.</p>
</div>
</div>
<div id="outline-container-headline-14" class="outline-4">
<h4 id="headline-14">
Buscas Especializadas para Tópicos Específicos
</h4>
<div id="outline-text-headline-14" class="outline-text-4">
<p>
Ao implementar seu sistema RAG, considere adicionar rotas especializadas de busca para certos tópicos. Por exemplo, se seu sistema precisa responder bem a consultas sobre JWT (JSON Web Tokens):</p>
<div class="src src-clojure">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-clojure" data-lang="clojure"><span class="line"><span class="cl"><span class="p">(</span><span class="kd">defn </span><span class="nv">query-pg-rag</span>
</span></span><span class="line"><span class="cl">  <span class="s">&#34;Processa uma consulta com tratamento especial para certos tópicos&#34;</span>
</span></span><span class="line"><span class="cl">  <span class="p">[</span><span class="nv">query</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">  <span class="c1">;; Verificar primeiro se é uma consulta relacionada a JWT</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="k">let </span><span class="p">[</span><span class="nv">lower-query</span> <span class="p">(</span><span class="nf">str/lower-case</span> <span class="nv">query</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="nv">jwt-keywords</span> <span class="p">[</span><span class="s">&#34;jwt&#34;</span> <span class="s">&#34;token&#34;</span> <span class="s">&#34;autenticação&#34;</span><span class="p">]]</span>
</span></span><span class="line"><span class="cl">    
</span></span><span class="line"><span class="cl">    <span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nb">some </span><span class="o">#</span><span class="p">(</span><span class="nf">str/includes?</span> <span class="nv">lower-query</span> <span class="nv">%</span><span class="p">)</span> <span class="nv">jwt-keywords</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">      <span class="c1">;; Busca especializada para JWT usando SQL direto</span>
</span></span><span class="line"><span class="cl">      <span class="p">(</span><span class="k">let </span><span class="p">[</span><span class="nv">conn</span> <span class="p">(</span><span class="nf">jdbc/get-connection</span> <span class="nv">db-spec</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">            <span class="nv">docs</span> <span class="p">(</span><span class="nf">jdbc/execute!</span> 
</span></span><span class="line"><span class="cl">                   <span class="nv">conn</span> 
</span></span><span class="line"><span class="cl">                   <span class="p">[</span><span class="s">&#34;SELECT id, titulo, conteudo FROM documentos 
</span></span></span><span class="line"><span class="cl"><span class="s">                     WHERE LOWER(conteudo) LIKE ? LIMIT 5&#34;</span>
</span></span><span class="line"><span class="cl">                    <span class="s">&#34;%jwt%&#34;</span><span class="p">])]</span>
</span></span><span class="line"><span class="cl">        <span class="c1">;; Processar resultados específicos de JWT...</span>
</span></span><span class="line"><span class="cl">        <span class="p">)</span>
</span></span><span class="line"><span class="cl">      
</span></span><span class="line"><span class="cl">      <span class="c1">;; Busca semântica padrão para outros tópicos</span>
</span></span><span class="line"><span class="cl">      <span class="p">(</span><span class="nf">semantic-search</span> <span class="nv">query</span> <span class="mi">5</span><span class="p">))))</span></span></span></code></pre></div>
</div>
<p>
Esta abordagem híbrida combina busca por palavras-chave para tópicos específicos com busca semântica para consultas gerais, melhorando a precisão global do sistema.</p>
<hr>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-15" class="outline-3">
<h3 id="headline-15">
Conclusão
</h3>
<div id="outline-text-headline-15" class="outline-text-3">
<p>
Neste artigo, exploramos como construir um sistema de busca semântica robusto usando PostgreSQL, pgvector, pgai e Ollama. Esta abordagem não só oferece melhor precisão em comparação com métodos tradicionais baseados em palavras-chave, mas também é altamente escalável e adequada para ambientes de produção.</p>
<p>
Vimos como configurar o ambiente usando Docker/Podman, como lidar com desafios comuns de comunicação entre contêineres, e implementamos estratégias para manter a persistência de modelos e melhorar a experiência do usuário. A combinação de busca semântica com técnicas específicas para tópicos especiais, como JWT, demonstra a flexibilidade desta abordagem.</p>
<p>
Para quem já trabalhou com RAG usando abordagens mais simples, como TF-IDF, esta implementação representa um salto significativo em termos de capacidades, mantendo a simplicidade operacional graças às ferramentas modernas que utilizamos.</p>
<p>
Quer saber mais sobre como implementar sistemas RAG avançados em seus projetos? Confira nossos outros artigos sobre o assunto e experimente o código completo disponível no <a href="https://github.com/lobovit/docai">repositório do DocAI</a>. Estamos ansiosos para ver o que você vai construir!</p>
<hr>
</div>
</div>
